src/cf/Catalogs/СостоянияЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗаказовПокупателей/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(Список.КомпоновщикНастроек.Настройки.УсловноеОформление,
		ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен"));
	
	Список.Порядок.Элементы.Очистить();
	
	Порядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("Наименование");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	// Установим настройки формы для случая открытия в режиме выбора
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Список.МножественныйВыбор = ?(Параметры.ЗакрыватьПриВыборе = Неопределено, Ложь, Не Параметры.ЗакрыватьПриВыборе);
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаСоздать") <> Неопределено Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздать.Видимость = НЕ Параметры.РежимВыбора;
	КонецЕсли;
	Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаСкопировать") <> Неопределено Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСкопировать.Видимость = НЕ Параметры.РежимВыбора;
	КонецЕсли;
	Если Параметры.РежимВыбора Тогда
		КлючНазначенияИспользования = КлючНазначенияИспользования + "ВыборПодбор";
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	Иначе
		КлючНазначенияИспользования = КлючНазначенияИспользования + "Список";
	КонецЕсли;
	
	СохранитьГлобальныеНастройки();
	ИзменитьТекстЗапросаПоПараметрам(Параметры);
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказовПокупателей" Тогда
		
		Если НЕ ИспользоватьВидыЗаказовПокупателей Тогда
			Если Параметр.Свойство("ЭтоНовый") И Параметр.Свойство("Ссылка") И Параметр.ЭтоНовый Тогда
				Если Источник.ВладелецФормы = Элементы.Список Тогда
					ВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказовПокупателей.Основной");
					ДобавитьСостояниеЗаказа(ВидЗаказа, Параметр.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(Список.КомпоновщикНастроек.Настройки.УсловноеОформление,
		Метаданные.Справочники.СостоянияЗаказовПокупателей.ПолноеИмя(),
		"Ссылка");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСостояниеЗаказа(ВидЗаказа, СостояниеЗаказа)
	
	ВидЗаказаОбъект = ВидЗаказа.ПолучитьОбъект();
	ВидЗаказаОбъект.Заблокировать();
	НоваяСтрока = ВидЗаказаОбъект.ПорядокСостояний.Добавить();
	НоваяСтрока.Состояние = СостояниеЗаказа;
	ВидЗаказаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТекстЗапросаПоПараметрам(Параметры)
	
	Если Не Параметры.Свойство("ОтображатьСостоянияЗаявок") И ЗаявкиИспользуются Тогда
		
		Список.ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние,
			|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
			|ПОМЕСТИТЬ втДоступныеСостоянияЗаказов
			|ИЗ
			|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
			|		ПО ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ВидыЗаказовПокупателей.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
			|
			|ИМЕЮЩИЕ
			|	МАКСИМУМ(ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки) = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка,
			|	СостоянияЗаказовПокупателей.ПометкаУдаления КАК ПометкаУдаления,
			|	СостоянияЗаказовПокупателей.Предопределенный КАК Предопределенный,
			|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
			|	ВЫБОР
			|		КОГДА СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗавершенПоследний
			|ИЗ
			|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
			|ГДЕ
			|	СостоянияЗаказовПокупателей.Ссылка В
			|			(ВЫБРАТЬ
			|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
			|			ИЗ
			|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ИспользоватьВидыЗаказовПокупателей = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	ЗаявкиИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
	
КонецПроцедуры

#КонецОбласти
